{
    "summary": "The function `mineCobblestone` ensures a wooden pickaxe is available, equips it, and explores to find stone blocks, mining 8 cobblestones each time until the maximum count is reached or no more blocks are found.",
    "details": [
        {
            "comment": "Function: Explore and collect cobblestone using wooden pickaxe\n- Check if wooden pickaxe is in inventory, craft one if not.\n- Equips wooden pickaxe if found, then explores until stone block is found.\n- Collects stone block when found and places it in the inventory.\n- Repeats process until a set number of cobblestones are collected.\n- Stops if maximum cobblestone count reached or if no more stone blocks are found.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/prompts/skill.txt\":0-23",
            "content": "You are a helpful assistant that writes a description of the given function written in Mineflayer javascript code.\n1) Do not mention the function name.\n2) Do not mention anything about `bot.chat` or helper functions.\n3) There might be some helper functions before the main function, but you only need to describe the main function.\n4) Try to summarize the function in no more than 6 sentences.\n5) Your response should be a single line of text.\nFor example, if the function is:\nasync function mineCobblestone(bot) {\n  // Check if the wooden pickaxe is in the inventory, if not, craft one\n  let woodenPickaxe = bot.inventory.findInventoryItem(mcData.itemsByName[\"wooden_pickaxe\"].id);\n  if (!woodenPickaxe) {\n    bot.chat(\"Crafting a wooden pickaxe.\");\n    await craftWoodenPickaxe(bot);\n    woodenPickaxe = bot.inventory.findInventoryItem(mcData.itemsByName[\"wooden_pickaxe\"].id);\n  }\n  // Equip the wooden pickaxe if it exists\n  if (woodenPickaxe) {\n    await bot.equip(woodenPickaxe, \"hand\");\n    // Explore until we find a stone block"
        },
        {
            "comment": "The function `mineCobblestone` checks for the availability of a wooden pickaxe in the inventory. If not, it crafts one. Afterward, equips the wooden pickaxe in the hand. It then explores until finding a stone block and mines 8 cobblestone blocks from that block. Upon successful completion, the bot informs about the mining event and saves it. If the wooden pickaxe is not available initially, it fails to mine cobblestones.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/prompts/skill.txt\":24-50",
            "content": "    await exploreUntil(bot, new Vec3(1, -1, 1), 60, () => {\n      const stone = bot.findBlock({\n        matching: mcData.blocksByName[\"stone\"].id,\n        maxDistance: 32\n      });\n      if (stone) {\n        return true;\n      }\n    });\n    // Mine 8 cobblestone blocks using the wooden pickaxe\n    bot.chat(\"Found a stone block. Mining 8 cobblestone blocks.\");\n    await mineBlock(bot, \"stone\", 8);\n    bot.chat(\"Successfully mined 8 cobblestone blocks.\");\n    // Save the event of mining 8 cobblestone\n    bot.save(\"cobblestone_mined\");\n  } else {\n    bot.chat(\"Failed to craft a wooden pickaxe. Cannot mine cobblestone.\");\n  }\n}\nThe main function is `mineCobblestone`.\nThen you would write:\nThe function is about mining 8 cobblestones using a wooden pickaxe. First check if a wooden pickaxe is in the inventory. If not, craft one. If the wooden pickaxe is available, equip the wooden pickaxe in the hand. Next, explore the environment until finding a stone block. Once a stone block is found, mine a total of 8 cobblestone blocks using the wooden pickaxe."
        }
    ]
}