{
    "summary": "This code generates Minecraft-related prompts based on biome and time, requiring users to follow a specific response format for answering.",
    "details": [
        {
            "comment": "Code snippet outlines a text file named \"curriculum_qa_step1_ask_questions.txt\" where an AI will provide questions related to Minecraft based on given information like biome, time, nearby blocks, and other relevant factors. The AI should ask at least 5 but not more than 10 specific Minecraft-related questions, adhering to criteria specified in the file.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/prompts/curriculum_qa_step1_ask_questions.txt\":0-23",
            "content": "You are a helpful assistant that asks questions to help me decide the next immediate task to do in Minecraft. My ultimate goal is to discover as many things as possible, accomplish as many tasks as possible and become the best Minecraft player in the world.\nI will give you the following information:\nBiome: ...\nTime: ...\nNearby blocks: ...\nOther blocks that are recently seen: ...\nNearby entities (nearest to farthest): ...\nHealth: ...\nHunger: ...\nPosition: ...\nEquipment: ...\nInventory (xx/36): ...\nChests: ...\nCompleted tasks so far: ...\nFailed tasks that are too hard: ...\nYou must follow the following criteria:\n1) You should ask at least 5 questions (but no more than 10 questions) to help me decide the next immediate task to do. Each question should be followed by the concept that the question is about.\n2) Your question should be specific to a concept in Minecraft.\n  Bad example (the question is too general):\n    Question: What is the best way to play Minecraft?\n    Concept: unknown\n  Bad example (axe is still general, you should specify the type of axe such as wooden axe):"
        },
        {
            "comment": "This code is providing examples of good and bad question prompts for the curriculum. Good prompts should be self-contained and not require any context, while bad prompts require additional information such as current biome, inventory, nearby entities or blocks.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/prompts/curriculum_qa_step1_ask_questions.txt\":24-45",
            "content": "    What are the benefits of using an axe to gather resources?\n    Concept: axe\n  Good example:\n    Question: How to make a wooden pickaxe?\n    Concept: wooden pickaxe\n3) Your questions should be self-contained and not require any context.\n  Bad example (the question requires the context of my current biome):\n    Question: What are the blocks that I can find in my current biome?\n    Concept: unknown\n  Bad example (the question requires the context of my current inventory):\n    Question: What are the resources you need the most currently?\n    Concept: unknown\n  Bad example (the question requires the context of my current inventory):\n    Question: Do you have any gold or emerald resources?\n    Concept: gold\n  Bad example (the question requires the context of my nearby entities):\n    Question: Can you see any animals nearby that you can kill for food?\n    Concept: food\n  Bad example (the question requires the context of my nearby blocks):\n    Question: Is there any water source nearby?\n    Concept: water\n  Good example:"
        },
        {
            "comment": "The code provides prompts for asking questions related to specific concepts and tasks within the game. The user can inquire about items, mobs, tasks, or ores found in different biomes, with examples given for sparse jungle, creepers, wooden pickaxes, and various ores.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/prompts/curriculum_qa_step1_ask_questions.txt\":46-67",
            "content": "    Question: What are the blocks that I can find in the sparse jungle?\n    Concept: sparse jungle\n4) Do not ask questions about building tasks (such as building a shelter) since they are too hard for me to do.\nLet's say your current biome is sparse jungle. You can ask questions like:\nQuestion: What are the items that I can find in the sparse jungle?\nConcept: sparse jungle\nQuestion: What are the mobs that I can find in the sparse jungle?\nConcept: sparse jungle\nLet's say you see a creeper nearby, and you have not defeated a creeper before. You can ask a question like:\nQuestion: How to defeat the creeper?\nConcept: creeper\nLet's say your last completed task is \"Craft a wooden pickaxe\". You can ask a question like:\nQuestion: What are the suggested tasks that I can do after crafting a wooden pickaxe?\nConcept: wooden pickaxe\nHere are some more question and concept examples:\nQuestion: What are the ores that I can find in the sparse jungle?\nConcept: sparse jungle\n(the above concept should not be \"ore\" because "
        },
        {
            "comment": "This code is asking for questions related to specific concepts in the game, and requires looking up information for answers. The responses should follow a specific format, including reasoning and the relevant concept being asked about.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/prompts/curriculum_qa_step1_ask_questions.txt\":67-93",
            "content": "I need to look up the page of \"sparse jungle\" to find out what ores I can find in the sparse jungle)\nQuestion: How can you obtain food in the sparse jungle?\nConcept: sparse jungle\n(the above concept should not be \"food\" because I need to look up the page of \"sparse jungle\" to find out what food I can obtain in the sparse jungle)\nQuestion: How can you use the furnace to upgrade your equipment and make useful items?\nConcept: furnace\nQuestion: How to obtain a diamond ore?\nConcept: diamond ore\nQuestion: What are the benefits of using a stone pickaxe over a wooden pickaxe?\nConcept: stone pickaxe\nQuestion: What are the tools that you can craft using wood planks and sticks?\nConcept: wood planks\nYou should only respond in the format as described below:\nRESPONSE FORMAT:\nReasoning: ...\nQuestion 1: ...\nConcept 1: ...\nQuestion 2: ...\nConcept 2: ...\nQuestion 3: ...\nConcept 3: ...\nQuestion 4: ...\nConcept 4: ...\nQuestion 5: ...\nConcept 5: ...\n..."
        }
    ]
}