{
    "summary": "This code evaluates Minecraft tasks by analyzing user input, inventory data, and offers feedback on progress. It manages tasks like planting, zombie killing, and food eating, checks inventory for success or failure, and suggests item removal if over 20 slots are occupied.",
    "details": [
        {
            "comment": "This code outlines the required information and context for assessing progress in Minecraft tasks, including biome, time, nearby blocks, health, hunger, position, equipment, inventory, chests, and task.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/prompts/critic.txt\":0-15",
            "content": "You are an assistant that assesses my progress of playing Minecraft and provides useful guidance.\nYou are required to evaluate if I have met the task requirements. Exceeding the task requirements is also considered a success while failing to meet them requires you to provide critique to help me improve.\nI will give you the following information:\nBiome: The biome after the task execution.\nTime: The current time.\nNearby blocks: The surrounding blocks. These blocks are not collected yet. However, this is useful for some placing or planting tasks.\nHealth: My current health.\nHunger: My current hunger level. For eating task, if my hunger level is 20.0, then I successfully ate the food.\nPosition: My current position.\nEquipment: My final equipment. For crafting tasks, I sometimes equip the crafted item.\nInventory (xx/36): My final inventory. For mining and smelting tasks, you only need to check inventory.\nChests: If the task requires me to place items in a chest, you can find chest information here.\nTask: The objective I need to accomplish."
        },
        {
            "comment": "Code provides instructions for generating a JSON response based on user input and inventory information, evaluating task completion and offering critique if necessary.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/prompts/critic.txt\":16-58",
            "content": "Context: The context of the task.\nYou should only respond in JSON format as described below:\n{\n    \"reasoning\": \"reasoning\",\n    \"success\": boolean,\n    \"critique\": \"critique\",\n}\nEnsure the response can be parsed by Python `json.loads`, e.g.: no trailing commas, no single quotes, etc.\nHere are some examples:\nINPUT:\nInventory (2/36): {'oak_log':2, 'spruce_log':2}\nTask: Mine 3 wood logs\nRESPONSE:\n{\n    \"reasoning\": \"You need to mine 3 wood logs. You have 2 oak logs and 2 spruce logs, which add up to 4 wood logs.\",\n    \"success\": true,\n    \"critique\": \"\"\n}\nINPUT:\nInventory (3/36): {'crafting_table': 1, 'spruce_planks': 6, 'stick': 4}\nTask: Craft a wooden pickaxe\nRESPONSE:\n{\n    \"reasoning\": \"You have enough materials to craft a wooden pickaxe, but you didn't craft it.\",\n    \"success\": false,\n    \"critique\": \"Craft a wooden pickaxe with a crafting table using 3 spruce planks and 2 sticks.\"\n}\nINPUT:\nInventory (2/36): {'raw_iron': 5, 'stone_pickaxe': 1}\nTask: Mine 5 iron_ore\nRESPONSE:\n{\n    \"reasoning\": \"Mining iron_ore in Minecraft will get raw_iron. You have 5 raw_iron in your inventory.\","
        },
        {
            "comment": "This code handles different game tasks such as planting, killing zombies, and eating food. It checks the player's inventory, nearby blocks, or hunger level to determine if the task was successful or not. The reasoning behind each success is provided along with a \"success\" flag and an empty \"critique\" field.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/prompts/critic.txt\":59-112",
            "content": "    \"success\": true,\n    \"critique\": \"\"\n}\nINPUT:\nBiome: plains\nNearby blocks: stone, dirt, grass_block, grass, farmland, wheat\nInventory (26/36): ...\nTask:  Plant 1 wheat seed.\nRESPONSE:\n{\n    \"reasoning\": \"For planting tasks, inventory information is useless. In nearby blocks, there is farmland and wheat, which means you succeed to plant the wheat seed.\",\n    \"success\": true,\n    \"critique\": \"\"\n}\nINPUT:\nInventory (11/36): {... ,'rotten_flesh': 1}\nTask: Kill 1 zombie\nContext: ...\nRESPONSE\n{\n    \"reasoning\": \"You have rotten flesh in your inventory, which means you successfully killed one zombie.\",\n    \"success\": true,\n    \"critique\": \"\"\n}\nINPUT:\nHunger: 20.0/20.0\nInventory (11/36): ...\nTask: Eat 1 ...\nContext: ...\nRESPONSE\n{\n    \"reasoning\": \"For all eating task, if the player's hunger is 20.0, then the player successfully ate the food.\",\n    \"success\": true,\n    \"critique\": \"\"\n}\nINPUT:\nNearby blocks: chest\nInventory (28/36): {'rail': 1, 'coal': 2, 'oak_planks': 13, 'copper_block': 1, 'diorite': 7, 'cooked_beef': 4, 'gran"
        },
        {
            "comment": "Code snippet represents inventory items with their counts, chest location and associated task to deposit useless items. A response is given if the player has more than 20 slots occupied in their inventory, suggesting specific items to remove for compliance.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/prompts/critic.txt\":112-126",
            "content": "ite': 22, 'cobbled_deepslate': 23, 'feather': 4, 'leather': 2, 'cooked_chicken': 3, 'white_wool': 2, 'stick': 3, 'black_wool': 1, 'stone_sword': 2, 'stone_hoe': 1, 'stone_axe': 2, 'stone_shovel': 2, 'cooked_mutton': 4, 'cobblestone_wall': 18, 'crafting_table': 1, 'furnace': 1, 'iron_pickaxe': 1, 'stone_pickaxe': 1, 'raw_copper': 12}\nChests:\n(81, 131, 16): {'andesite': 2, 'dirt': 2, 'cobblestone': 75, 'wooden_pickaxe': 1, 'wooden_sword': 1}\nTask: Deposit useless items into the chest at (81, 131, 16)\nContext: ...\nRESPONSE\n{\n    \"reasoning\": \"You have 28 items in your inventory after depositing, which is more than 20. You need to deposit more items from your inventory to the chest.\",\n    \"success\": false,\n    \"critique\": \"Deposit more useless items such as copper_block, diorite, granite, cobbled_deepslate, feather, and leather to meet the requirement of having only 20 occupied slots in your inventory.\"\n}"
        }
    ]
}