{
    "summary": "The code allows the Mineflayer bot to move, change equipment, target blocks/entities using goals and functions. It demonstrates how to activate an item and use it on an entity in proper order for functionality.",
    "details": [
        {
            "comment": "This code contains various goals and functions that can be used with the Mineflayer bot for movement, equipment changes, and targeting specific blocks or entities. The `goto` function allows the bot to move towards a specified goal location, while other goals like `GoalNear`, `GoalXZ`, `GoalGetToBlock`, `GoalFollow`, `GoalPlaceBlock`, and `GoalLookAtBlock` provide more specific options for targeting and movement.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/control_primitives_context/mineflayer.js\":0-9",
            "content": "await bot.pathfinder.goto(goal); // A very useful function. This function may change your main-hand equipment.\n// Following are some Goals you can use:\nnew GoalNear(x, y, z, range); // Move the bot to a block within the specified range of the specified block. `x`, `y`, `z`, and `range` are `number`\nnew GoalXZ(x, z); // Useful for long-range goals that don't have a specific Y level. `x` and `z` are `number`\nnew GoalGetToBlock(x, y, z); // Not get into the block, but get directly adjacent to it. Useful for fishing, farming, filling bucket, and beds. `x`, `y`, and `z` are `number`\nnew GoalFollow(entity, range); // Follow the specified entity within the specified range. `entity` is `Entity`, `range` is `number`\nnew GoalPlaceBlock(position, bot.world, {}); // Position the bot in order to place a block. `position` is `Vec3`\nnew GoalLookAtBlock(position, bot.world, {}); // Path into a position where a blockface of the block at position is visible. `position` is `Vec3`\n// These are other Mineflayer functions you can use:"
        },
        {
            "comment": "The code provides a bot object with various Minecraft-related functions. The 'bot.isABed()' checks if 'bedBlock' is a bed, while 'bot.blockAt()' retrieves the block at specified position. Other functions allow equipping items, consuming items, fishing, sleeping until sunrise, activating blocks, and looking at specific positions using the bot object.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/control_primitives_context/mineflayer.js\":10-19",
            "content": "bot.isABed(bedBlock); // Return true if `bedBlock` is a bed\nbot.blockAt(position); // Return the block at `position`. `position` is `Vec3`\n// These are other Mineflayer async functions you can use:\nawait bot.equip(item, destination); // Equip the item in the specified destination. `item` is `Item`, `destination` can only be \"hand\", \"head\", \"torso\", \"legs\", \"feet\", \"off-hand\"\nawait bot.consume(); // Consume the item in the bot's hand. You must equip the item to consume first. Useful for eating food, drinking potions, etc.\nawait bot.fish(); // Let bot fish. Before calling this function, you must first get to a water block and then equip a fishing rod. The bot will automatically stop fishing when it catches a fish\nawait bot.sleep(bedBlock); // Sleep until sunrise. You must get to a bed block first\nawait bot.activateBlock(block); // This is the same as right-clicking a block in the game. Useful for buttons, doors, etc. You must get to the block first\nawait bot.lookAt(position); // Look at the spec"
        },
        {
            "comment": "The code snippet is from the Voyager project's \"mineflayer.js\" file, where it demonstrates how to activate an item (such as a bucket) and use it on an entity (e.g., filling the bucket with water). The sequence starts by activating the item using \"await bot.activateItem();\", followed by using the item on the entity with \"await bot.useOn(entity);\". It's crucial to follow this order - equip the item first and then use it on the entity for proper functionality in the Minecraft game.",
            "location": "\"/media/root/Prima/works/Voyager/docs/src/voyager/control_primitives_context/mineflayer.js\":19-21",
            "content": "ified position. You must go near the position before you look at it. To fill bucket with water, you must lookAt first. `position` is `Vec3`\nawait bot.activateItem(); // This is the same as right-clicking to use the item in the bot's hand. Useful for using buckets, etc. You must equip the item to activate first\nawait bot.useOn(entity); // This is the same as right-clicking an entity in the game. Useful for shearing sheep, equipping harnesses, etc. You must get to the entity first"
        }
    ]
}